/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Tidak Boleh Selesaikan Tindakan";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Cuba lagi kemudian.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Tidak Boleh Buka";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Format media ini tidak disokong.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Tidak Boleh Buka";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "Media ini mungkin rosak.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Tidak Boleh Buka";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "App ini tidak dibenarkan untuk memainkan fail ini."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Tidak Boleh Buka";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Media ini tidak boleh digunakan.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Tidak Boleh Nyahkod";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "Penyahkod yang diperlukan untuk media ini sibuk.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Hentikan sebarang tindakan lain yang menyahkod media dan cuba lagi.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "Tidak Boleh Buka";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "Media tidak boleh digunakan pada komputer ini.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "Tidak boleh buka";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "Kandungan tidak boleh dimainkan pada paparan luaran.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "Tidak boleh buka";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "Kandungan yang dilindungi tidak boleh dimainkan dalam konfigurasi sistem semasa.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "Trek video output transkod mempunyai kiraan bingkai yang salah";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "Kiraan bingkai output transkod tidak sama dengan sumber yang tidak mempunyai segmen edit";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "Gagal untuk dinyahkod";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "penyahkod mengalami ralat";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "Gagal untuk dikodkan";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "pengekod mengalami ralat";

